<a href="https://colab.research.google.com/github/BrianEisenberg/teste/blob/main/Lista_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#1) 

import pandas as pd
titanic=pd.read_csv('/content/drive/MyDrive/class_titanic.csv')
data_titanic=pd.DataFrame(titanic)
print(data_titanic)

     PassengerId  Pclass                                               Name  \
0              1       3                            Braund, Mr. Owen Harris
1              2       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3       3                             Heikkinen, Miss. Laina
3              4       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5       3                           Allen, Mr. William Henry
..           ...     ...                                                ...
886          887       2                              Montvila, Rev. Juozas
887          888       1                       Graham, Miss. Margaret Edith
888          889       3           Johnston, Miss. Catherine Helen "Carrie"
889          890       1                              Behr, Mr. Karl Howell
890          891       3                                Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
0      male  22.0      1      0         A/5 21171   7.2500   NaN        S
1    female  38.0      1      0          PC 17599  71.2833   C85        C
2    female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3    female  35.0      1      0            113803  53.1000  C123        S
4      male  35.0      0      0            373450   8.0500   NaN        S
..      ...   ...    ...    ...               ...      ...   ...      ...
886    male  27.0      0      0            211536  13.0000   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0            111369  30.0000  C148        C
890    male  32.0      0      0            370376   7.7500   NaN        Q

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 12 columns]

In [ ]:
#2

print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [ ]:
#3

data_titanic.dropna(subset=['Parch'], inplace=True)
print(data_titanic)

     PassengerId  Pclass                                               Name  \
0              1       3                            Braund, Mr. Owen Harris
1              2       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3       3                             Heikkinen, Miss. Laina
3              4       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5       3                           Allen, Mr. William Henry
..           ...     ...                                                ...
886          887       2                              Montvila, Rev. Juozas
887          888       1                       Graham, Miss. Margaret Edith
888          889       3           Johnston, Miss. Catherine Helen "Carrie"
889          890       1                              Behr, Mr. Karl Howell
890          891       3                                Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
0      male  22.0      1      0         A/5 21171   7.2500   NaN        S
1    female  38.0      1      0          PC 17599  71.2833   C85        C
2    female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3    female  35.0      1      0            113803  53.1000  C123        S
4      male  35.0      0      0            373450   8.0500   NaN        S
..      ...   ...    ...    ...               ...      ...   ...      ...
886    male  27.0      0      0            211536  13.0000   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0            111369  30.0000  C148        C
890    male  32.0      0      0            370376   7.7500   NaN        Q

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 12 columns]

In [ ]:
#4

med_parch=data_titanic['Parch'].mean()
print(med_parch)

0.38159371492704824

In [ ]:
#5

maior_que_media=data_titanic[(data_titanic['Parch']>4)].index
menor_que_media=data_titanic[(data_titanic['Parch']<1)].index
sem_maior=data_titanic.drop(maior_que_media)
titanic_novo=sem_maior.drop(menor_que_media)
med_nova=titanic_novo['Parch'].mean()
print(med_nova)
print(titanic_novo)

1.4927536231884058
     PassengerId  Pclass                                               Name  \
7              8       3                     Palsson, Master. Gosta Leonard
8              9       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10            11       3                    Sandstrom, Miss. Marguerite Rut
16            17       3                               Rice, Master. Eugene
24            25       3                      Palsson, Miss. Torborg Danira
..           ...     ...                                                ...
869          870       3                    Johnson, Master. Harold Theodor
871          872       1   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
879          880       1      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880          881       2       Shelley, Mrs. William (Imanita Parrish Hall)
888          889       3           Johnston, Miss. Catherine Helen "Carrie"

        Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked  Survived
7      male   2.0      3      1      349909  21.0750   NaN        S         0
8    female  27.0      0      2      347742  11.1333   NaN        S         1
10   female   4.0      1      1     PP 9549  16.7000    G6        S         1
16     male   2.0      4      1      382652  29.1250   NaN        Q         0
24   female   8.0      3      1      349909  21.0750   NaN        S         0
..      ...   ...    ...    ...         ...      ...   ...      ...       ...
869    male   4.0      1      1      347742  11.1333   NaN        S         1
871  female  47.0      1      1       11751  52.5542   D35        S         1
879  female  56.0      0      1       11767  83.1583   C50        C         1
880  female  25.0      0      1      230433  26.0000   NaN        S         1
888  female   NaN      1      2  W./C. 6607  23.4500   NaN        S         0

[207 rows x 12 columns]

In [ ]:
#6

col_name=titanic_novo['Name']
col_sex=titanic_novo['Sex']
col_age=titanic_novo['Age']
col_parch=titanic_novo['Parch']
col_ticket=titanic_novo['Ticket']
resultado=pd.concat([col_name,col_sex,col_age,col_parch,col_ticket],axis=1)
print(resultado)

                                                  Name     Sex   Age  Parch  \
7                       Palsson, Master. Gosta Leonard    male   2.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      2
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
16                                Rice, Master. Eugene    male   2.0      1
24                       Palsson, Miss. Torborg Danira  female   8.0      1
..                                                 ...     ...   ...    ...
869                    Johnson, Master. Harold Theodor    male   4.0      1
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      1
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      1
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      2

         Ticket
7        349909
8        347742
10      PP 9549
16       382652
24       349909
..          ...
869      347742
871       11751
879       11767
880      230433
888  W./C. 6607

[207 rows x 5 columns]

In [ ]:
#7

import random
col_num1=titanic_novo['Age']
col_num2=titanic_novo['Parch']
titanic_novo.insert(0, 'Diferença', ((col_num1-col_num2)*random.random()).astype(float))
print(data_titanic)
print(titanic_novo)

     PassengerId  Pclass                                               Name  \
0              1       3                            Braund, Mr. Owen Harris
1              2       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3       3                             Heikkinen, Miss. Laina
3              4       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5       3                           Allen, Mr. William Henry
..           ...     ...                                                ...
886          887       2                              Montvila, Rev. Juozas
887          888       1                       Graham, Miss. Margaret Edith
888          889       3           Johnston, Miss. Catherine Helen "Carrie"
889          890       1                              Behr, Mr. Karl Howell
890          891       3                                Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
0      male  22.0      1      0         A/5 21171   7.2500   NaN        S
1    female  38.0      1      0          PC 17599  71.2833   C85        C
2    female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3    female  35.0      1      0            113803  53.1000  C123        S
4      male  35.0      0      0            373450   8.0500   NaN        S
..      ...   ...    ...    ...               ...      ...   ...      ...
886    male  27.0      0      0            211536  13.0000   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0            111369  30.0000  C148        C
890    male  32.0      0      0            370376   7.7500   NaN        Q

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 12 columns]
     Diferença  PassengerId  Pclass  \
7     0.685024            8       3
8    17.125595            9       3
10    2.055071           11       3
16    0.685024           17       3
24    4.795167           25       3
..         ...          ...     ...
869   2.055071          870       3
871  31.511096          872       1
879  37.676310          880       1
880  16.440572          881       2
888        NaN          889       3

                                                  Name     Sex   Age  SibSp  \
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
16                                Rice, Master. Eugene    male   2.0      4
24                       Palsson, Miss. Torborg Danira  female   8.0      3
..                                                 ...     ...   ...    ...
869                    Johnson, Master. Harold Theodor    male   4.0      1
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

     Parch      Ticket     Fare Cabin Embarked  Survived
7        1      349909  21.0750   NaN        S         0
8        2      347742  11.1333   NaN        S         1
10       1     PP 9549  16.7000    G6        S         1
16       1      382652  29.1250   NaN        Q         0
24       1      349909  21.0750   NaN        S         0
..     ...         ...      ...   ...      ...       ...
869      1      347742  11.1333   NaN        S         1
871      1       11751  52.5542   D35        S         1
879      1       11767  83.1583   C50        C         1
880      1      230433  26.0000   NaN        S         1
888      2  W./C. 6607  23.4500   NaN        S         0

[207 rows x 13 columns]

In [ ]:
#8

import numpy as np
rand_titanic=titanic_novo.reindex(np.random.permutation(titanic_novo.index))
print(rand_titanic)

     Diferença  PassengerId  Pclass  \
436  13.015452          437       3
148  23.633322          149       2
848  18.495643          849       2
323  14.385500          324       2
254  26.715929          255       3
..         ...          ...     ...
754  31.511096          755       2
548  21.920762          549       3
736  30.826072          737       3
340   0.685024          341       2
297   0.000000          298       1

                                                  Name     Sex   Age  SibSp  \
436               Ford, Miss. Doolina Margaret "Daisy"  female  21.0      2
148           Navratil, Mr. Michel ("Louis M Hoffman")    male  36.5      0
848                                  Harper, Rev. John    male  28.0      0
323  Caldwell, Mrs. Albert Francis (Sylvia Mae Harb...  female  22.0      1
254           Rosblom, Mrs. Viktor (Helena Wilhelmina)  female  41.0      0
..                                                 ...     ...   ...    ...
754                   Herman, Mrs. Samuel (Jane Laver)  female  48.0      1
548                          Goldsmith, Mr. Frank John    male  33.0      1
736            Ford, Mrs. Edward (Margaret Ann Watson)  female  48.0      1
340                     Navratil, Master. Edmond Roger    male   2.0      1
297                       Allison, Miss. Helen Loraine  female   2.0      1

     Parch      Ticket      Fare    Cabin Embarked  Survived
436      2  W./C. 6608   34.3750      NaN        S         0
148      2      230080   26.0000       F2        S         0
848      1      248727   33.0000      NaN        S         0
323      1      248738   29.0000      NaN        S         1
254      2      370129   20.2125      NaN        S         0
..     ...         ...       ...      ...      ...       ...
754      2      220845   65.0000      NaN        S         1
548      1      363291   20.5250      NaN        S         0
736      3  W./C. 6608   34.3750      NaN        S         0
340      1      230080   26.0000       F2        S         1
297      2      113781  151.5500  C22 C26        S         0

[207 rows x 13 columns]

In [ ]:
#9

rand_titanic2=rand_titanic.sort_values(by='Age', ascending=False)
print(rand_titanic2)

     Diferença  PassengerId  Pclass                               Name  \
745  47.266643          746       1       Crosby, Capt. Edward Gifford
54   43.841524           55       1     Ostby, Mr. Engelhart Cornelius
438  41.101429          439       1                  Fortune, Mr. Mark
684  40.416405          685       2  Brown, Mr. Thomas William Solomon
587  40.416405          588       1   Frolicher-Stehli, Mr. Maxmillian
..         ...          ...     ...                                ...
180        NaN          181       3       Sage, Miss. Constance Gladys
176        NaN          177       3      Lefebre, Master. Henry Forbes
140        NaN          141       3      Boulos, Mrs. Joseph (Sultana)
792        NaN          793       3            Sage, Miss. Stella Anna
846        NaN          847       3           Sage, Mr. Douglas Bullen

        Sex   Age  SibSp  Parch     Ticket      Fare        Cabin Embarked  \
745    male  70.0      1      1  WE/P 5735   71.0000          B22        S
54     male  65.0      0      1     113509   61.9792          B30        C
438    male  64.0      1      4      19950  263.0000  C23 C25 C27        S
684    male  60.0      1      1      29750   39.0000          NaN        S
587    male  60.0      1      1      13567   79.2000          B41        C
..      ...   ...    ...    ...        ...       ...          ...      ...
180  female   NaN      8      2   CA. 2343   69.5500          NaN        S
176    male   NaN      3      1       4133   25.4667          NaN        S
140  female   NaN      0      2       2678   15.2458          NaN        C
792  female   NaN      8      2   CA. 2343   69.5500          NaN        S
846    male   NaN      8      2   CA. 2343   69.5500          NaN        S

     Survived
745         0
54          0
438         0
684         0
587         1
..        ...
180         0
176         0
140         0
792         0
846         0

[207 rows x 13 columns]

In [ ]:
#10

sobrev_por_genero=rand_titanic2.drop(columns=['Diferença','PassengerId','Pclass','Name','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked'])
sobrev_por_genero.groupby('Sex').sum('Survived')

        Survived
Sex
female        79
male          29

In [ ]:
#11
#dividir a taxa por 10

rand_titanic2['Fare']=rand_titanic2['Fare'].map(lambda x:x/10)
print(rand_titanic2)

     Diferença  PassengerId  Pclass                               Name  \
745  47.266643          746       1       Crosby, Capt. Edward Gifford
54   43.841524           55       1     Ostby, Mr. Engelhart Cornelius
438  41.101429          439       1                  Fortune, Mr. Mark
684  40.416405          685       2  Brown, Mr. Thomas William Solomon
587  40.416405          588       1   Frolicher-Stehli, Mr. Maxmillian
..         ...          ...     ...                                ...
180        NaN          181       3       Sage, Miss. Constance Gladys
176        NaN          177       3      Lefebre, Master. Henry Forbes
140        NaN          141       3      Boulos, Mrs. Joseph (Sultana)
792        NaN          793       3            Sage, Miss. Stella Anna
846        NaN          847       3           Sage, Mr. Douglas Bullen

        Sex   Age  SibSp  Parch     Ticket      Fare        Cabin Embarked  \
745    male  70.0      1      1  WE/P 5735   7.10000          B22        S
54     male  65.0      0      1     113509   6.19792          B30        C
438    male  64.0      1      4      19950  26.30000  C23 C25 C27        S
684    male  60.0      1      1      29750   3.90000          NaN        S
587    male  60.0      1      1      13567   7.92000          B41        C
..      ...   ...    ...    ...        ...       ...          ...      ...
180  female   NaN      8      2   CA. 2343   6.95500          NaN        S
176    male   NaN      3      1       4133   2.54667          NaN        S
140  female   NaN      0      2       2678   1.52458          NaN        C
792  female   NaN      8      2   CA. 2343   6.95500          NaN        S
846    male   NaN      8      2   CA. 2343   6.95500          NaN        S

     Survived
745         0
54          0
438         0
684         0
587         1
..        ...
180         0
176         0
140         0
792         0
846         0

[207 rows x 13 columns]

In [36]:
#12
from google.colab import drive
drive.mount('/drive',force_remount=True)
rand_titanic2.to_csv('/drive/MyDrive/rand_titanic2.csv')

Mounted at /drive

In [38]:
#13

drive.mount('/drive',force_remount=True)
rand_titanic2.to_json('/drive/MyDrive/rand_titanic2.json')

Mounted at /drive